app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `price`, `image_link`, `created_at`, `updated_at`) VALUES ('Gorra', 699.99, 'https://http2.mlstatic.com/D_Q_NP_749331-MLM25926584126_082017-Q.jpg', '2017-12-27 00:47:47', '2017-12-27 00:47:47')